chipKIT32/chipKIT-core/pic32/boards.txt
# new items
chipkit_WF32.platform=pic32
chipkit_WF32.build.board=_BOARD_WF32_
chipkit_WF32.ldscript=chipKIT-application-32MX695F512.ld
# end of new items

chipkit_WF32.upload.protocol=stk500v2
chipkit_WF32.upload.maximum_size=520192
chipkit_WF32.upload.maximum_data_size=131072
chipkit_WF32.upload.speed=115200
chipkit_WF32.upload.tool=pic32prog

chipkit_WF32.build.mcu=32MX695F512L
chipkit_WF32.build.f_cpu=80000000L
chipkit_WF32.build.core=pic32
chipkit_WF32.build.variant=WF32
chipkit_WF32.build.ldscript.path={build.variant.path}

chipkit_WiFire.name=chipKIT WiFire
chipkit_WiFire.group=chipKIT

# new items
chipkit_WiFire.platform=pic32
chipkit_WiFire.build.board=_BOARD_WIFIRE_
chipkit_WiFire.ldscript=MZ-application-32MZ2048ECX.ld
# end of new items

chipkit_WiFire.upload.protocol=stk500v2
chipkit_WiFire.upload.maximum_size=2080768
chipkit_WiFire.upload.maximum_data_size=524288
chipkit_WiFire.upload.speed=115200
chipkit_WiFire.upload.tool=pic32prog

chipkit_WiFire.build.mcu=32MZ2048EFG100
chipkit_WiFire.build.f_cpu=200000000UL
chipkit_WiFire.build.core=pic32
chipkit_WiFire.ldcommon=chipKIT-application-COMMON-MZ.ld
chipkit_WiFire.build.variant=WiFire
chipkit_WiFire.build.ldscript.path={build.variant.path}

chipkit_WiFire.usb.enabled=true
chipkit_WiFire.usb.default=z_custom

chipkit_WiFire_80MHz.name=chipKIT WiFire 80MHz
chipkit_WiFire_80MHz.group=chipKIT

chipkit_WiFire_80MHz.usb.enabled=true
chipkit_WiFire_80MHz.usb.default=z_custom

# new items
chipkit_WiFire_80MHz.platform=pic32
chipkit_WiFire_80MHz.build.board=_BOARD_WIFIRE_80MHZ_
chipkit_WiFire_80MHz.ldscript=MZ-application-32MZ2048ECX.ld
# end of new items

chipkit_WiFire_80MHz.upload.protocol=stk500v2
chipkit_WiFire_80MHz.upload.maximum_size=520192
chipkit_WiFire_80MHz.upload.maximum_data_size=524288
chipkit_WiFire_80MHz.upload.speed=115200
chipkit_WiFire_80MHz.upload.tool=pic32prog

chipkit_WiFire_80MHz.build.mcu=32MZ2048ECG100
chipkit_WiFire_80MHz.build.f_cpu=80000000UL
chipkit_WiFire_80MHz.build.core=pic32
chipkit_WiFire_80MHz.ldcommon=chipKIT-application-COMMON-MZ.ld
chipkit_WiFire_80MHz.build.variant=WiFire
chipkit_WiFire_80MHz.build.ldscript.path={build.variant.path}

chipkit_WiFire_AB.name=chipKIT WiFire (RevA&B, No FPU)
chipkit_WiFire_AB.group=chipKIT

chipkit_WiFire_AB.usb.enabled=true
chipkit_WiFire_AB.usb.default=z_custom

# new items
chipkit_WiFire_AB.platform=pic32
chipkit_WiFire_AB.build.board=_BOARD_WIFIRE_
chipkit_WiFire_AB.ldscript=MZ-application-32MZ2048ECX.ld
# end of new items

chipkit_WiFire_AB.upload.protocol=stk500v2
chipkit_WiFire_AB.upload.maximum_size=2080768
chipkit_WiFire_AB.upload.maximum_data_size=524288
chipkit_WiFire_AB.upload.speed=115200
chipkit_WiFire_AB.upload.tool=pic32prog

chipkit_WiFire_AB.build.mcu=32MZ2048ECG100
chipkit_WiFire_AB.build.f_cpu=200000000UL
chipkit_WiFire_AB.build.core=pic32
chipkit_WiFire_AB.ldcommon=chipKIT-application-COMMON-MZ.ld
chipkit_WiFire_AB.build.variant=WiFire
chipkit_WiFire_AB.build.ldscript.path={build.variant.path}


CUI32stem.name=CUI32stem
CUI32stem.group=CUI32

# new items
CUI32stem.platform=pic32
CUI32stem.build.board=_BOARD_CUI32_

CUI32stem.usb.enabled=true
CUI32stem.usb.default=a_cdcacm

CUI32stem.ldscript=chipKIT-application-32MX795F512.ld
# end of new items

CUI32stem.upload.protocol=stk500v2
CUI32stem.upload.maximum_size=520192
CUI32stem.upload.maximum_data_size=131072
CUI32stem.upload.speed=115200
CUI32stem.upload.tool=pic32prog

CUI32stem.build.mcu=32MX795F512H
CUI32stem.build.f_cpu=80000000L
CUI32stem.build.core=pic32
CUI32stem.build.variant=CUI32stem

fubarino_mini.name=Fubarino Mini
fubarino_mini.group=Fubarino

fubarino_mini.platform=pic32
fubarino_mini.build.board=_BOARD_FUBARINO_MINI_

fubarino_mini.usb.enabled=true
fubarino_mini.usb.default=a_cdcacm

fubarino_mini.ccflags=-Map="map.map"
fubarino_mini.ldscript=chipKIT-application-32MX250F128.ld
# Use this -G1024 option ONLY for boards with 64K RAM or less
fubarino_mini.compiler.c.extra_flags=-G1024
fubarino_mini.compiler.cpp.extra_flags=-G1024

fubarino_mini.upload.protocol=stk500v2
# 128KB - 4K for EEPROM - 4K for bootloader
fubarino_mini.upload.maximum_size=122880
fubarino_mini.upload.maximum_data_size=32768
fubarino_mini.upload.speed=115200
fubarino_mini.upload.tool=pic32prog

fubarino_mini.build.mcu=32MX250F128D
fubarino_mini.build.f_cpu=48000000L
fubarino_mini.build.core=pic32
fubarino_mini.build.variant=Fubarino_Mini

fubarino_mini.menu.Frequency.48=48MHz
fubarino_mini.menu.Frequency.build.f_cpu=48000000L
fubarino_mini.menu.Frequency.40=40MHz (Dev Version)
fubarino_mini.menu.Frequency.build.f_cpu=40000000L

fubarino_sd.name=Fubarino SD
fubarino_sd.group=Fubarino

fubarino_sd.platform=pic32
fubarino_sd.build.board=_BOARD_FUBARINO_SD_

fubarino_sd.menu.Version.v15=1.5
fubarino_sd.menu.Version.v15.ldscript=chipKIT-application-32MX795F512.ld
fubarino_sd.menu.Version.v15.build.mcu=32MX795F512H
fubarino_sd.menu.Version.v15.upload.maximum_size=520192
fubarino_sd.menu.Version.v15.upload.maximum_data_size=131072

fubarino_sd.menu.Version.v14=1.4 (Seeed)
fubarino_sd.menu.Version.v14.ldscript=chipKIT-application-32MX440F256.ld
fubarino_sd.menu.Version.v14.build.mcu=32MX440F256H
fubarino_sd.menu.Version.v14.upload.maximum_size=258048
fubarino_sd.menu.Version.v14.upload.maximum_data_size=32768

fubarino_sd.usb.enabled=true
fubarino_sd.usb.default=a_cdcacm

fubarino_sd.upload.protocol=stk500v2
fubarino_sd.upload.speed=115200
fubarino_sd.upload.tool=pic32prog

fubarino_sd.build.f_cpu=80000000L
fubarino_sd.build.core=pic32
fubarino_sd.build.variant=Fubarino_SD

Fubarino_SDZ.name=Fuarbino SDZ
Fubarino_SDZ.group=Fubarino

Fubarino_SDZ.usb.enabled=true
Fubarino_SDZ.usb.default=a_cdcacm

# new items
Fubarino_SDZ.platform=pic32
Fubarino_SDZ.build.board=_BOARD_FUBARINO_SDZ_
Fubarino_SDZ.ldscript=MZ-application-32MZ2048ECX.ld
# end of new items

Fubarino_SDZ.upload.protocol=stk500v2
Fubarino_SDZ.upload.maximum_size=2093056
Fubarino_SDZ.upload.maximum_data_size=524288
Fubarino_SDZ.upload.speed=115200
Fubarino_SDZ.upload.tool=pic32prog

Fubarino_SDZ.build.mcu=32MZ2048ECH064
Fubarino_SDZ.build.f_cpu=200000000UL
Fubarino_SDZ.build.core=pic32
Fubarino_SDZ.ldcommon=chipKIT-application-COMMON-MZ.ld
Fubarino_SDZ.build.variant=Fubarino_SDZ
Fubarino_SDZ.build.ldscript.path={build.variant.path}

clicker2.name=MikroElektronika Clicker 2
clicker2.group=MikroElektronika
clicker2.platform=pic32
clicker2.build.board=_BOARD_CLICKER2_PIC32MX_
clicker2.ccflags=-Map="map.map"
clicker2.ldscript=chipKIT-application-32MX460F512-uhb.ld

clicker2.usb.enabled=true
clicker2.usb.default=a_cdcacm

clicker2.usb.vid=1234
clicker2.usb.pid=0001
clicker2.usb.protocol=uhb

clicker2.compiler.c.extra_flags=
clicker2.compiler.cpp.extra_flags=
clicker2.upload.protocol=stk500v2

clicker2.upload.maximum_size=500000
clicker2.upload.speed=115200
clicker2.upload.tool=pic32prog-hid

clicker2.build.mcu=32MX460F512L
clicker2.build.f_cpu=80000000L
clicker2.build.core=pic32
clicker2.build.variant=Clicker2

flipnclickmz.name=MikroElektronika Flip N Click MZ
flipnclickmz.group=MikroElektronika
flipnclickmz.platform=pic32
flipnclickmz.build.board=_BOARD_PIC32MZ_FLIP_N_CLICK_
flipnclickmz.ccflags=-Map="map.map"
flipnclickmz.ldscript=MZ-application-32MZ2048ECX.ld
flipnclickmz.ldcommon=chipKIT-application-COMMON-MZ.ld

flipnclickmz.usb.enabled=true
flipnclickmz.usb.default=a_cdcacm

flipnclickmz.compiler.c.extra_flags=
flipnclickmz.compiler.cpp.extra_flags=
flipnclickmz.upload.protocol=stk500v2

flipnclickmz.upload.maximum_size=2080768
flipnclickmz.upload.maximum_data_size=524288
flipnclickmz.upload.speed=115200
flipnclickmz.upload.tool=pic32prog

flipnclickmz.bootloader.low_fuses=0xff
flipnclickmz.bootloader.high_fuses=0xdd
flipnclickmz.bootloader.extended_fuses=0x00
#flipnclickmz.bootloader.path=not-supported
#flipnclickmz.bootloader.file=not-supported
flipnclickmz.bootloader.unlock_bits=0x3F
flipnclickmz.bootloader.lock_bits=0x0F

