chipKIT32/chipKIT-core/pic32/boards.txt
CUI32stem.menu.USB.a_cdcacm=Serial
CUI32stem.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
CUI32stem.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
CUI32stem.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
CUI32stem.menu.USB.z_custom=Custom / Disabled
CUI32stem.menu.USB.z_custom.build.extra_flags=

ubw32_mx460.menu.USB.a_cdcacm=Serial
ubw32_mx460.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
ubw32_mx460.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
ubw32_mx460.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
ubw32_mx460.menu.USB.z_custom=Custom / Disabled
ubw32_mx460.menu.USB.z_custom.build.extra_flags=

chipkit_DP32.menu.USB.a_cdcacm=Serial
chipkit_DP32.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
chipkit_DP32.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
chipkit_DP32.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
chipkit_DP32.menu.USB.z_custom=Custom / Disabled
chipkit_DP32.menu.USB.z_custom.build.extra_flags=

fubarino_mini.menu.USB.a_cdcacm=Serial
fubarino_mini.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
fubarino_mini.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
fubarino_mini.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
fubarino_mini.menu.USB.z_custom=Custom / Disabled
fubarino_mini.menu.USB.z_custom.build.extra_flags=

mega_pic32.menu.USB.z_custom=Custom / Disabled
mega_pic32.menu.USB.z_custom.build.extra_flags=
mega_pic32.menu.USB.a_cdcacm=Serial
mega_pic32.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
mega_pic32.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
mega_pic32.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__

chipkit_WiFire_80MHz.menu.USB.z_custom=Custom / Disabled
chipkit_WiFire_80MHz.menu.USB.z_custom.build.extra_flags=
chipkit_WiFire_80MHz.menu.USB.a_cdcacm=Serial
chipkit_WiFire_80MHz.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
chipkit_WiFire_80MHz.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
chipkit_WiFire_80MHz.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__

clicker2.menu.USB.a_cdcacm=Serial
clicker2.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
clicker2.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
clicker2.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
clicker2.menu.USB.z_custom=Custom / Disabled
clicker2.menu.USB.z_custom.build.extra_flags=

chipkit_Pi.menu.USB.z_custom=Custom / Disabled
chipkit_Pi.menu.USB.z_custom.build.extra_flags=
chipkit_Pi.menu.USB.a_cdcacm=Serial
chipkit_Pi.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
chipkit_Pi.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
chipkit_Pi.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__

chipkit_pro_mx7.menu.USB.z_custom=Custom / Disabled
chipkit_pro_mx7.menu.USB.z_custom.build.extra_flags=
chipkit_pro_mx7.menu.USB.a_cdcacm=Serial
chipkit_pro_mx7.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
chipkit_pro_mx7.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
chipkit_pro_mx7.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__

Fubarino_SDZ.menu.USB.a_cdcacm=Serial
Fubarino_SDZ.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
Fubarino_SDZ.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
Fubarino_SDZ.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
Fubarino_SDZ.menu.USB.z_custom=Custom / Disabled
Fubarino_SDZ.menu.USB.z_custom.build.extra_flags=

chipkit_WiFire_AB.menu.USB.z_custom=Custom / Disabled
chipkit_WiFire_AB.menu.USB.z_custom.build.extra_flags=
chipkit_WiFire_AB.menu.USB.a_cdcacm=Serial
chipkit_WiFire_AB.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
chipkit_WiFire_AB.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
chipkit_WiFire_AB.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__

OpenScope.menu.USB.a_cdcacm=Serial
OpenScope.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
OpenScope.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
OpenScope.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
OpenScope.menu.USB.z_custom=Custom / Disabled
OpenScope.menu.USB.z_custom.build.extra_flags=

flipnclickmz.menu.USB.a_cdcacm=Serial
flipnclickmz.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
flipnclickmz.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
flipnclickmz.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
flipnclickmz.menu.USB.z_custom=Custom / Disabled
flipnclickmz.menu.USB.z_custom.build.extra_flags=

cui32.menu.USB.a_cdcacm=Serial
cui32.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
cui32.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
cui32.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
cui32.menu.USB.z_custom=Custom / Disabled
cui32.menu.USB.z_custom.build.extra_flags=

pontech_NoFire.menu.USB.a_cdcacm=Serial
pontech_NoFire.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
pontech_NoFire.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
pontech_NoFire.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
pontech_NoFire.menu.USB.z_custom=Custom / Disabled
pontech_NoFire.menu.USB.z_custom.build.extra_flags=

